Repository: nashultz/Alfred
Catalog: locale/*/LC_MESSAGES/alfred.po
Languages: fr

source: Received admin command {command} from unauthorized user, {user}!
fr: Commande d'administrateur {command} reçue à partir d'un utilisateur non autorisé {user}!

source: "{entered_word}" is not a Pokemon! Did you mean "{corrected_word}"?
fr: "{entered_word}" n'est pas un Pokémon! Voulez-vous dire "{corrected_word}"?

source: "{entered_word}" is not a Pokemon! Check your spelling!
fr: "{entered_word}" n'est pas un Pokémon! Vérifiez l'écriture!

source: This channel timer has expired! The channel has been deactivated and will be deleted in 5 minutes. To reactivate the channel, use !timerset to set the timer again.
fr: Ce salon de raid a expiré! Le salon a été désactivé et sera supprimé dans 5 minutes. Pour réactiver le salon, utilisez **!timerset** pour réinitialiser la minuterie.v

source: That's right!
fr: Aucun soucis!

source: That's right! I've been rebooted! You don't need to do anything this time, but you may find some commands don't respond in currently active channels, or the channels may not delete as expected. Sorry for any inconvenience!
fr: J'ai été redémarré! Vous n'avez pas besoin de faire de quoi cette fois, mais c'est possible que certaines commandes ne fonctionnent pas dans les salons actuellement actifs, ou les salons peuvent ne pas supprimer comme prévu. Désolé pour tout inconvénient!

source: I'm Alfred, a Discord helper bot for Pokemon Go communities, and someone has invited me to your server! Type !help to see a list of things I can do, and type !configure in any channel of your server to begin!
fr: Je suis Alfred, un robot qui aide les communautés Pokémon Go sur Discord, et quelqu'un m'a invitié à votre serveur! Tapez **!help** pour voir une liste de choses que je peux faire, et tapez **!configure** dans n'importe quelle salon de votre serveur pour commencer!

source: __**Alfred Configuration**__ That's Right! Welcome to the configuration for Alfred the Pokemon Go Helper Bot! I will be guiding you through some setup steps to get me setup on your server. **Team Assignment Configuration** First, I have a feature that allows users to assign their Pokemon Go team using roles. If you have a bot that handles this already, or you don't want this feature, type N, otherwise type Y to enable the feature!
fr: __**Configuration de Alfred**__ Bienvenue dans la configuration de Alfred, le robot assistant de Pokémon Go! Je vais vous guider à travers certaines étapes d'installation pour me configurer sur votre serveur. **Configuration de l'équipe** Tout d'abord, j'ai une fonctionnalité qui permet aux utilisateurs d'assigner leur équipe Pokémon Go en utilisant les rôles. Si vous avez un robot qui le gère déjà, ou si vous ne voulez pas cette fonctionnalité, tapez N, sinon tapez Y pour activer la fonctionnalité!

source: Team assignments enabled! Please make sure that my role is moved to the top of your server role hierarchy, or at least above your team roles. Your team roles must be 'mystic', 'valor', and 'instinct' and *must* be lowercase. I should have made some for you if you didn't have them, you can set their colors and other settings later.
fr: Les affectations d'équipe sont activées! Assurez-vous que mon rôle est déplacé vers le haut de votre hiérarchie de rôle de serveur, ou au moins au-dessus de vos rôles d'équipe. Les rôles de vos équipes doivent être «mystic», «valor» et «instinct» en anglais et *doivent* être en minuscules. J'aurais dû en faire quelques-unes si vous ne les avez pas, vous pouvez régler leurs couleurs et autres paramètres plus tard.

source: **Welcome Message Configuration** Next, I have a feature where I welcome new members to the server with a short welcome message in a channel or with a direct message. If you have a bot that handles this already, or if you don't want this feature, type N, otherwise type Y to enable this feature!
fr: **Configuration des messages de bienvenue** Ensuite, j'ai une fonctionnalité où j'accueille de nouveaux membres au serveur avec un petit message de bienvenue dans un salon ou avec un message direct. Si vous avez déjà un robot qui le gère, ou si vous ne voulez pas cette fonctionnalité, tapez N, sinon tapez Y pour activer cette fonctionnalité!

source: Sample message:```Welcome to [SERVER], @[MEMBER]! Set your team by typing '!team mystic' or '!team valor' or '!team instinct' without quotations. If you have any questions just ask an admin.```
fr: Exemple de message:```Bienvenue sur [SERVER], @[MEMBER]! Choisir votre équipe en tapant «!team mystic» ou «!team valor» ou «!team instinct» sans guillemets. Si vous avez des questions, demandez à un administrateur.```

source: Sample message:```Welcome to [SERVER], @[MEMBER]! If you have any questions just ask an admin.```
fr: Exemple de message:```Bienvenue sur [SERVER], @[MEMBER]! Si vous avez des questions, demandez à un administrateur.```

source: Welcome message enabled! **Welcome Message Channel Configuration** Now I need to know what channel you want me to post these welcome messages in. Reply with a channel name or 'DM' if you would rather I direct message the user.
fr: Message de bienvenue activé! **Configuration du salon de message de bienvenue** Maintenant, j'ai besoin de savoir dans quel salon vous voulez publier ces messages de bienvenue. Répondez avec le nom du salon, ou avec «DM» si vous préférez que je communique directement avec l'utilisateur.

source: **Main Function Configuration** Alright. Next I just want to check that you want to enable *any* of my main functions. These include assigning roles for each Pokemon a user wants, wild spawn reports, creating channels for raids, and keeping track of users coming to each raid. If you don't want me to do *any* of that, type N, otherwise type Y to start enabling my main functions!
fr: **Configuration de la fonction principale** Bien. Ensuite, je veux simplement vérifier que vous voulez activer *toutes* mes principales fonctions. Ceux-ci incluent l'attribution de rôles pour chaque Pokémon qu'un utilisateur voudrait, les rapports de Pokémon sauvages, la création de salons pour les raids et le suivi des utilisateurs qui arrivent à chaque raid. Si vous ne voulez pas que je fasse au moins *un* de cela, tapez N, sinon tapez Y pour commencer à activer mes principales fonctions!

source: Okay. Now make sure that I have either an admin role on your server, or at least a role with these permissions: 'read messages', 'send messages', 'embed links', 'manage roles', and 'manage channels'. Also, check if my role is at the top of your server role hierarchy.
fr: D'accord. Maintenant, assurez-vous que j'ai un rôle d'administration sur votre serveur, ou au moins un rôle avec ces autorisations: «lire les messages», «envoyer des messages», «intégrer des liens», «gérer les rôles» et «gérer les salons». Vérifiez également si mon rôle est au sommet de votre hiérarchie de rôle de serveur.

source: **City Channel Configuration** Next, I need to know which channels will be used for raid and/or wild reports. If your server covers only one community, that's probably your server's default channel. If you cover multiple communities, you should probably have a channel for each community that only those with roles for that community can see. Otherwise your users could be spammed with notifications for raids that are not relevant to them!
fr: **Configuration des salons de villes** Ensuite, je dois savoir quels salons seront utilisés pour les rapports de raid et/ou Pokémon sauvages. Si votre serveur ne couvre qu'une seule communauté, c'est probablement le salon par défaut de votre serveur. Si vous couvrez plusieurs communautés, vous devriez probablement avoir un salon pour chaque communauté que seuls ceux qui ont des rôles pour cette communauté peuvent voir. Sinon, vos utilisateurs pourraient être «spammés» avec des notifications de raids qui ne leur sont pas pertinentes!

source: Here's what I need: a list of channels in your server that will be used for raid and/or wild reports. Give them in this format: channelname, channelname, channelname
fr: Voici ce que j'ai besoin: une liste des salons dans votre serveur qui sera utilisé pour les rapports de raids et/ou Pokémon sauvages. Donnez-les dans ce format: nom-de-salon, nom-de-salon, nom-de-salon

source: In other words, the name of each channel, each separated by a comma and a single space. If you do not require raid and wild reporting and are only requiring want/unwant, reply with 'N'; however, want/unwant is quite limited without raid or wild reporting.
fr: En d'autres termes, le nom de chaque salon, chacun séparé par une virgule et un espace unique. Si vous n'avez pas besoin de raid et de rapports sauvages et ne requiert que «want/unwant», répondez avec N; Cependant, le «want/unwant» est assez limité sans raid ou rapports sauvages.

source: Great! Looks like all of these are names of channels in your server.
fr: Génial! On dirait que tous ces noms sont des noms des salons dans votre serveur.

source: Something went wrong! Please type !configure to start over! Make sure the channels above are created already!
fr: Il y a eu un problème! Tapez **!configure** pour recommencer! Assurez-vous que les salons ci-dessus sont déjà créés!

source: **City Location Configuration** Alright, we need to set starting locations for each of the channels you just mentioned in the SAME ORDER you typed before. This is what I use to generate Google Maps links to give people directions to raids and spawns! Knowing what town everything is in is often good enough to narrow it down. One way to put it is, for each channel you just listed, I need a location specific enough that I'll know hich First Baptist Church people mean. This is important, so please enter it in just this way. For each channel, give me a location using only letters, no punctuation. So something like 'kansas city mo' or 'hull uk' without the quotes and separate your locations with a comma and single space.
fr: **Configuration des emplacements des villes** D'accord, nous devons définir les emplacements de départ pour chacun des salons que vous venez de mentionner dans le MÊME ORDRE que vous avez tapé auparavant. C'est ce que j'utilise pour générer des liens Google Maps pour donner aux gens des instructions pour se rendre aux raids et aux Pokémon sauvages! Savoir dans quelle ville tout se trouve est souvent assez. Une façon de le dire est que, pour chaque salon que vous venez d'énumérer, j'ai besoin d'un emplacement précis pour savoir quelle Église Baptiste les gens font référence. Ceci est important, alors, inscrivez-le de cette façon. Pour chaque chaîne, donnez-moi un emplacement en utilisant uniquement des lettres, pas de ponctuation. Donc, quelque chose comme «laval qc» ou «Hull Royaume-Uni» sans guillemets et séparez vos emplacements avec une virgule et un espace unique.

source: There weren't the same number of cities and channels! Please type !configure to start over!
fr: Il n'y avait pas le même nombre de villes et de salons! Tapez **!configure** pour recommencer!

source: **Raid Command** Alright. Do you want raid reports in these channels? Reply with 'Y' to enable !raid reports, or 'N' to disable !raid
fr: **Commande de raid** Bien. Voulez-vous des rapports de raid dans ces salons? Réponde avec 'Y' pour activer les rapports de **!raid**, ou 'N' pour désactiver **!raid**.

source: **Timezone Configuration** Ok, to finish the raid configuration I need to know what timezone you're in! This will help me coordinate raids for you. The current 24-hr time UTC is {utctime}. How many hours off from that are you? Please enter your answer as a number between -12 and 12.
fr: **Configuration de la fuseau horaire** Ok, pour terminer la configuration du raid, j'ai besoin de savoir dans quel fuseau horaire vous êtes! Cela m'aidera à coordonner des raids pour vous. Le UTC actuel de 24 heures est {utctime}. À combien d'heures de différence êtes-vous? Entrez votre réponse avec un nombre entre -12 et 12.

source: I couldn't convert your answer to a number! Type !configure in your server to start again.
fr: Je n'ai pas pu convertir votre réponse à un nombre! Tapez **!configure** dans votre serveur pour recommencer.

source: **Wild Command** Alright. Do you want wild reports in these channels? Reply with 'Y' to enable !wild reports, or 'N' to disable !wild
fr: **Commande pour Pokémon sauvages** Bien. Voulez-vous des rapports sauvages dans ces salons? Répondre avec 'Y' pour activer les rapports **!wild**, ou 'N' pour les désactiver.

source: Ok. Time to do one last check that I have either an admin role on your server, or at least a role with these permissions: 'read messages', 'send messages', 'embed links', 'manage roles', and 'manage channels'. Also, check if my role is at the top of your server role hierarchy. You can restrict me to specific channels by editing channel-specific permissions if you like. **Want/Unwant Configuration** The last thing you should know is that the !want and !unwant commands can produce a lot of clutter if they are allowed on your main channels. I suggest having a dedicated channel for want and unwant. Just type the name or names of the channel(s) you want me to allow. If you type something that isn't a name of an existing channel, I'll create one by that name. If you do not want to enable want/unwant, reply with 'N'.
fr: D'accord. C'est le temps de faire une dernière vérification que j'ai un rôle d'administrateur sur votre serveur, ou au moins un rôle avec ces permissions:«lire les messages», «envoyer des messages», «intégrer des liens», «gérer les rôles» et «gérer les salons». Vérifiez également si mon rôle est au sommet de votre hiérarchie de rôle de serveur. Vous pouvez me limiter à des salons spécifiques en modifiant les permissions spécifiques du salon si vous le souhaitez. **Configuration want/unwant** La dernière chose que vous devriez savoir, c'est que les commandes **!want** et **!unwant** peuvent produire beaucoup d'encombrement s'ils sont autorisés dans les salons principaux. Je suggère d'avoir un salon dédié pour want/unwant. Tapez simplement le nom ou les noms des salons que vous souhaitez que je permette. Si vous tapez quelque chose qui n'est pas un nom d'un salon existant, je vais en créer un avec ce nom. Si vous ne voulez pas activer la commande want/unwant, répondez avec N.

source: You didn't give me enough permissions! Type !configure to start over!
fr: Vous ne m'avez pas donné suffisamment de permissions! Tapez **!configure** pour recommencer!

source: Okay. All of my main functions have been disabled.
fr: D'accord. Toutes mes principales fonctions ont été désactivées.

source: **Emojis** Alright! I'm ready to go! One more thing. I like to use custom emoji for certain things, especially for displaying type weaknesses for raid bosses! I'm going to send you a .rar file that contains all the emoji I need. There are 23 in all. All you have to do is download, extract, and upload the images to Discord as custom emoji. You can do this all at once, and you can just leave the emoji titles alone! By the way: if you need to change any of these settings, just type !configure in your server and we can do this again.
fr: **Émojis** Bien! Je suis prêt à partir! Encore une chose. J'aime utiliser des émojis personnalisés pour certaines choses, en particulier pour afficher les faiblesses pour les Pokémon de raid! Je vais vous envoyer un fichier .rar qui contient tous les émojis dont j'ai besoin. Il y en a 23 au total. Tout ce que vous avez à faire est de télécharger les émojis sur votre ordinateur, de les extraire et de télécharger les images sur Discord comme émoji personnalisé (dans les paramètres du serveur). Vous pouvez le faire tout à la fois, et vous pouvez simplement ne pas changer les titres de ces émojis! Si vous devez changer l'un de ces paramètres, tapez !configure dans votre serveur et nous pouvons le faire à nouveau.

source: If you have any questions just ask an admin.
fr: Si vous avez une question, demandez à un administrateur.

source: Welcome to {server.name}, {new_member_name.mention}!
fr: Bienvenue à {server.name}, {new_member_name.mention}!

source: Set your team by typing {team_command} without quotations.
fr: Définissez votre équipe en tapant {team_command} sans les guillemets.

source: WARNING: no default channel configured. Unable to send welcome message.
fr: ATTENTION: aucun salon par défaut n'est configuré. Impossible d'envoyer le message de bienvenue.

source: Error occured while trying to save!
fr: Une erreur s'est produite lors de l'enregistrement de sauvegarde!

source: My roles are ranked lower than the following team roles: **{higher_roles_list}** Please get an admin to move my roles above them!
fr: Mes rôles sont inférieurs aux rôles suivants: **{higher_roles_list} ** Contacter un administrateur pour déplacer mes rôles au-dessus d'eux!

source: You already have a team role!
fr: Vous avez déjà un rôle d'équipe!

source: WARNING: Role {team_role} in team_dict not configured as a role on the server!
fr: ATTENTION: Le rôle {team_role} dans team_dict n'est pas configuré comme un rôle sur le serveur!

source: "{entered_team}" isn't a valid team! Try {available_teams}
fr: "{entered_team}" n'est pas une équipe valide ! Essayez {available_teams}

source: The "{entered_team}" role isn't configured on this server! Contact an admin!
fr: Le rôle "{entered_team}" n'est pas configuré sur ce serveur ! Contacter un administrateur!

source: Added {member} to Team {team_name}! {team_emoji}
fr: {member} ajouté à l'équipe {team_name}! {team_emoji}

source: I can't add roles!
fr: Je ne peux pas ajouter de rôle!

source: Please use one of the following channels for **!want** commands: {want_channel_list}
fr: Utilisez l'un des salons suivants pour les commandes **!want **: {want_channel_list}

source: {member}, I already know you want {pokemon}!
fr: {member}, je sais déjà que vous voulez {pokemon}!

source: Got it! {member} wants {pokemon}
fr: Compris! {member} veut {pokemon}

source: Please restrict wild reports to city channels or the default channel!
fr: Limitez les rapports sauvages aux salons de la ville ou dans le salon par défaut!

source: Give more details when reporting! Usage: **!wild <pokemon name> <location>**
fr: Donnez moi plus d'informations s'il vous plaît! Utilisez: **!wild <nom du pokemon> <localisation>**

source: Click here for directions to the wild {pokemon}!
fr: Cliquez ici pour obtenir les directions vers le {pokemon} sauvage!

source: This is just my best guess!
fr: Voici ma meilleure suggestion!

source: Wild {pokemon} reported by {member}! Details:{location_details}
fr: Un {pokemon} sauvage a été reporté par {member}! Détails: {location_details}

source: **!wild** commands have been disabled.
fr: Les commandes **!wild** ont été désactivées.

source: Please restrict raid reports to a city channel or the default channel!
fr: Veuillez limiter les rapports de raid à un salon de ville ou dans le salon par défaut!

source: Give more details when reporting! Usage: **!raid <pokemon name> <location>**
fr: Donnez moi plus d'informations s'il vous plaît! Utilisez: **!raid <nom du pokemon> <localisation>**

source: The Pokemon {pokemon} does not appear in raids!
fr: Le Pokemon {pokemon} n'apparaît pas en raid!

source: Click here for directions to the raid!
fr: Cliquer ici pour obtenir les directions pour le raid!

source: Weaknesses: {weakness_list}
fr: Faiblesses: {weakness_list}

source: {pokemon} raid reported by {member}! Details:{location_details}. Coordinate in {raid_channel}
fr: Un {pokemon} a été reporté dans un raid par {member}! Détails: {location_details}. Coordonner dans {raid_channel}

source: {pokemon} raid reported by {member}! Details:{location_details}. Coordinate here! Reply to this message with **!coming** (`!coming [number]` for trainers with you) to say you are on your way, and reply with **!here** once you arrive. If you are at the raid already, reply with **!here** (`!here [number]` for trainers with you). If you are interested in the raid and want to wait for a group, use **!maybe**. If your plans change, reply with **!cancel** if you are no longer on the way or if you have left the raid. You can set the time remaining with **!timerset H:MM** and access this with **!timer**. You can see the list of trainers interested with **!interest**, trainers on their way with **!otw**, trainers at the raid with **!waiting**, or all lists with **!lists**. Once you start a raid, use **!starting** to clear the waiting list to allow the next group to coordinate. Sometimes I'm not great at directions, but I'll correct my directions if anybody sends me a maps link. This channel will be deleted in 2 hours or five minutes after the timer expires.
fr: Raid de {pokemon} rapporté par {member}! Détails: {location_details}. Coordonnez ici! Répondez à ce message avec **!coming** (`!coming [chiffre]` pour les joueurs avec vous) pour dire que vous êtes sur votre chemin. Une fois que vous arrivez, ou si vous êtes déjà au raid, répondez avec **!here** (`!here [chiffre]` pour les joueurs avec vous). Si vous êtes intéressé(e) par le raid et souhaitez attendre un groupe, utilisez **!maybe**. Si vos plans changent, répondez avec **!cancel** si vous n'êtes plus sur le chemin ou si vous avez quitté le raid. Vous pouvez régler le temps restant avec **!timerset H:MM** et voir le temps restant avec **!timer**. Vous pouvez voir la liste des joeurs intéressés avec **!interest**, les joueurs en route avec **!otw**, le joueurs au raid avec **!waiting**, ou toutes ces listes ensemble avec **!lists**. Une fois que vous démarrez un raid, utilisez **!starting** pour effacer la liste d'attente pour permettre au prochain groupe de se coordonner. Parfois, je ne suis pas bon avec les directions, mais je vais corriger mes directions si quelqu'un m'envoie un lien de Google Maps. Ce salon sera supprimé dans 2 heures si aucun temps d'expiration a été spécifié pour le raid.

source: Hey {member}, if you can, set the time left on the raid using **!timerset H:MM** so others can check it with **!timer**.
fr: {member}, si vous le pouvez, définissez le temps restant sur le raid en utilisant **!timerset H:MM** afin que les autres puissent le voir avec **!timer**.

source: {member}, I already know you don't want {pokemon}!
fr: {member}, je sais déjà que vous ne voulez pas {pokemon}!

source: Got it! {member} no longer wants {pokemon}
fr: Compris! {member} ne cherche plus {pokemon}!

source: This raid's timer has already expired as of {expiry_time}!
fr: La minuterie de ce raid a déjà expiré à partir de {expiry_time}!

source: This raid will end at {expiry_time}!
fr: Le raid se termine à {expiry_time}!

source: No one told me when the raid ends, so I'm assuming it will end at {expiry_time}!
fr: Personne ne m'a dit quand le raid se termine, alors je suppose que ça se terminera à {expiry_time}!

source: Alfred...that's too long. Raids currently last no more than two hours...
fr: Alfred... c'est trop long. Les raids ne durent actuellement pas plus de deux heures.

source: Alfred...I can't do that! No negative numbers, please!
fr: Alfred... Je ne peux pas faire ça! Pas de chiffres négatifs, s'il vous plaît!

source: Alfred...I couldn't understand your time format...
fr: Alfred... Je n'arrive pas à comprendre le format de l'heure...

source: Alfred... I couldn't understand your time format. Try again like this: !timerset H:MM
fr: Alfred... Je n'arrive pas à comprendre votre format pour l'heure. Essayez de nouveau comme ceci: **!timerset H:MM**

source: {0} is interested!
fr: {0} est intéressé(e)!

source: {member} is interested with a total of {trainer_count} trainers!
fr: {member} est intéressé(e) avec un total de {trainer_count} joueurs!

source: {member} is on the way!
fr: {member} est en chemin!
