Repository: nashultz/Alfred
Catalog: locale/*/LC_MESSAGES/alfred.po
Languages: fr

source: {member} is on the way with a total of {trainer_count} trainers!
fr: {member} est en chemin avec un total de {trainer_count} joueurs!

source: {member} is at the raid!
fr: {member} attend au raid!

source: {member} is at the raid with a total of {trainer_count} trainers!
fr: {member} est au raid avec un total de {trainer_count} joueurs!

source: {member} is no longer interested!
fr: {member} n'est plus intéressé(e)!

source: {member} and their total of {trainer_count} trainers are no longer interested!
fr: {member} et le total de {trainer_count} joueurs avec lui ne sont plus intéressé(e)s!

source: {member} has left the raid!
fr: {member} a quitté le raid!

source: {member} and their total of {trainer_count} trainers have left the raid!
fr: {member} et le total de {trainer_count} joueurs avec lui ont quitté le raid!

source: {member} is no longer on their way!
fr: {member} n'est plus en chemin!

source: {member} and their total of {trainer_count} trainers are no longer on their way!
fr: {member} et le total de {trainer_count} joueurs avec lui ne sont plus en chemin!

source: Someone has suggested a different location for the raid than what I guessed! Trainers {trainer_list}: make sure you are headed to the right place!
fr: Quelqu'un a suggéré un lieu différent pour le raid que ce que j'ai supposé! Joueurs {trainer_list}: assurez-vous d'aller au bon endroit!

source: Exactly *how many* are interested? There wasn't a number anywhere in your message. Or, just say `!maybe` if you're by yourself.
fr: Exactement *combien* sont intéressés? Il n'y avait aucun numéro dans votre message. Ou dites simplement **!maybe** si vous êtes seul.

source: Alfred...I got confused because there were several numbers in your message. I don't know which one is the right one.
fr: Alfred... Je me suis confondu parce qu'il y avait plusieurs chiffres dans votre message. Je ne sais pas lequel est le bon.

source: Exactly *how many* are coming? There wasn't a number anywhere in your message. Or, just say **!coming** if you're by yourself.
fr: Exactement *combien* arrivent-ils? Il n'y avait aucun numéro dans votre message. Ou dites simplement **!coming ** si vous êtes seul.

source: Exactly *how many* are here? There wasn't a number anywhere in your message. Or, just say **!here** if you're by yourself.
fr: Exactement *combien* sont-ils ici? Il n'y avait aucun numéro dans votre message. Ou dites simplement **!here ** si vous êtes seul.

source: including {trainer_list} and the people with them! Let them know if there is a group forming
fr: avec {trainer_list} et les joueurs avec eux! Faites-leur savoir s'il y a un groupe qui se forme.

source: {trainer_count} interested{including_string}!
fr: {trainer_count} intéressé(s){including_string}!

source: including {trainer_list} and the people with them! Be considerate and wait for them if possible
fr: avec {trainer_list} et les joueurs avec eux! Merci de les attendre si possible.

source: {trainer_count} on the way{including_string}!
fr: {trainer_count} en chemin{including_string}!

source: including {trainer_list} and the people with them! Be considerate and let them know if and when you'll be there
fr: avec {trainer_list} et les personnes avec eux! Merci de préciser dans combien de temps vous arrivez.

source: {trainer_count} waiting at the raid{including_string}!
fr: {trainer_count} attend(ent) au raid{including_string}!

source: Current Raids in {0}:
fr: Raids actuels dans {0}:

source: {0.mention} - interested = {1}, {2} = {3}, {4} = {5}, Ends at {6}
fr: {0.mention} - intéressé(s) = {1}, {2} = {3}, {4} = {5}, Fini à {6}

source: No active raids! Report one with **!raid <name> <location>**.
fr: Il n'y a pas de raids actifs! Signaler un avec: **!raid <nom du pokemon> <localisation>**.

source: The group that was waiting is starting the raid! Trainers {trainer_list}, please respond with {here_emoji} or !here if you are waiting for another group!
fr: Le groupe qui attendait vient de lancer le raid! Joueurs {trainer_list}, merci de répondre avec {here_emoji} ou avec **!here** si vous faites un autre groupe!

source: How can you start when there's no one waiting at this raid!?
fr: Comment pouvez-vous commencer quand il n'y a personne en attente pour ce raid!?

source: Hey {member}, I don't know if you meant **!coming** to say that you are coming or **!otw** to see the other trainers on their way
fr: {member}, je ne sais pas si vous vouliez dire **!coming** pour dire que vous venez ou **!otw** pour voir les autres joueurs en route.

source: Hey {member}, I don't know if you meant **!maybe** to say that you are interested or **!interest** to see the other trainers interest
fr: {membre}, je ne sais pas si vous vouliez dire **!maybe** pour dire que vous êtes intéressé(e) ou **!interest** pour voir l'intérêt des autres joueurs.

source: This channel has been reported as a duplicate and has been deactivated. Check the channel list for the other raid channel to coordinate in! If this was an error you can reset the raid with **!timerset**
fr: Ce salon a été signalé comme une duplication et a été désactivé. Vérifiez la liste des salons pour l'autre salon de raid à coordonner! S'il s'agissait d'une erreur, vous pouvez réinitialiser le raid avec **!timerset**

source: We're missing the new location details! Usage: **!location <location>**
fr: Nous manquons les détails du nouvel emplacement! Utilisez: **!location <location>**

source: Someone has suggested a different location for the raid! Trainers {trainer_list}: make sure you are headed to the right place!
fr: Quelqu'un a suggéré un lieu différent pour le raid! Joueurs {trainer_list}: assurez-vous d'aller au bon endroit!
